# StairsAttrMinimumTreadDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrMinimumTreadDepth Property
ParameterTypeId Class See Also
---
"Minimum Tread Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrMinimumTreadDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrMinimumTreadDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrMinimumTreadDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace